БИТУправление_медицинским_центром_демо/src/ChartsOfCalculationTypes/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Начисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>EnumRef.ФормулыРасчетаЗаработнойПлаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчета1</name>
    <type>
      <types>EnumRef.ПоказателиРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчета2</name>
    <type>
      <types>EnumRef.ПоказателиРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчета3</name>
    <type>
      <types>EnumRef.ПоказателиРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПараметра1</name>
    <type>
      <types>EnumRef.ВидыПараметровРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПараметра2</name>
    <type>
      <types>EnumRef.ВидыПараметровРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПараметра3</name>
    <type>
      <types>EnumRef.ВидыПараметровРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностиВидовРасчета</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

БИТУправление_медицинским_центром_демо/src/Enums/ПериодичностиВидовРасчета/ПериодичностиВидовРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностиВидовРасчета</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ПоказателиРасчетаНачислений/ПоказателиРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиРасчетаНачислений</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
  <enumValues>
    <name>Себестоимость</name>
  </enumValues>
  <enumValues>
    <name>СуммаБезСкидок</name>
  </enumValues>
  <enumValues>
    <name>Параметр1</name>
  </enumValues>
  <enumValues>
    <name>Параметр2</name>
  </enumValues>
  <enumValues>
    <name>Параметр3</name>
  </enumValues>
  <enumValues>
    <name>СуммаОплат</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьПоПрайсу</name>
  </enumValues>
  <enumValues>
    <name>КоличествоДнейПоТабелю</name>
  </enumValues>
  <enumValues>
    <name>КоличествоЧасовПоТабелю</name>
  </enumValues>
  <enumValues>
    <name>СуммаПродажУслуг</name>
  </enumValues>
  <enumValues>
    <name>СуммаПродажТоваров</name>
  </enumValues>
  <enumValues>
    <name>СуммаПродажАбонементов</name>
  </enumValues>
  <enumValues>
    <name>ДнейПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ЧасовПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ДнейОтработаноПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ЧасовОтработаноПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ДнейОтработаноСверхНормы</name>
  </enumValues>
  <enumValues>
    <name>ЧасовОтработаноСверхНормы</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/ChartsOfCalculationTypes/Начисления/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(Периодичность) Тогда
		Периодичность = Перечисления.ПериодичностиВидовРасчета.Месяц;
	КонецЕсли;
	
	ПоказателиГрафика = Новый Массив;
	ПоказателиГрафика.Добавить(Перечисления.ПоказателиРасчетаНачислений.ДнейПоНорме);
	ПоказателиГрафика.Добавить(Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноПоНорме);
	ПоказателиГрафика.Добавить(Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноСверхНормы);
	ПоказателиГрафика.Добавить(Перечисления.ПоказателиРасчетаНачислений.ЧасовПоНорме);
	ПоказателиГрафика.Добавить(Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноПоНорме);
	ПоказателиГрафика.Добавить(Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноСверхНормы);
	
	Если (ПоказателиГрафика.Найти(ПоказательРасчета1) <> Неопределено ИЛИ
			ПоказателиГрафика.Найти(ПоказательРасчета2) <> Неопределено ИЛИ
			ПоказателиГрафика.Найти(ПоказательРасчета3) <> Неопределено)
		И Периодичность <> Перечисления.ПериодичностиВидовРасчета.Месяц
	Тогда
	    ТекстСообщения = НСтр("ru='Не допускается использование видов начислений, использующих данные графика работы, с периодичностью отличной от ""Месяц""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
